In [1]:
import pandas as pd
import numpy as np

In [ ]:
## Import classes to SQL

In [6]:
#### Reads the JSON file (Pandas)

In [3]:
df_customer_transaction = pd.read_json("customer_transaction_info.json")

In [8]:
#### Shows the first number of students

In [5]:
df_customer_transaction.head()

      txn_id  avail_date last_name first_name    birthday
0  TXN-24546  2030-09-08     ORTIZ    EDUARDO  1990-07-08
1  TXN-14642  2026-05-26    NIENOW        LEA  2000-11-26
2  TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
3  TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
4  TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22

In [9]:
#### Shows the length of columns (data) in the json file

In [6]:
len(df_customer_transaction)

130653

In [4]:
df_customer_transaction.head(130654)

           txn_id  avail_date last_name first_name    birthday
0       TXN-24546  2030-09-08     ORTIZ    EDUARDO  1990-07-08
1       TXN-14642  2026-05-26    NIENOW        LEA  2000-11-26
2       TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
3       TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
4       TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
...           ...         ...       ...        ...         ...
130648  TXN-65468  2012-06-16  Cummings      Henry  2005-08-14
130649  TXN-60822  2020-09-28      Feil     Jermey  2010-06-15
130650  TXN-60822  2020-09-28      Feil     Jermey  2010-06-15
130651  TXN-01784  2015-01-11   Schmidt     Emilie  1996-05-21
130652  TXN-01784  2015-01-11   Schmidt     Emilie  1996-05-21

[130653 rows x 5 columns]

In [ ]:
## Convert the original customer.json file to sqlite

In [7]:
from sqlalchemy import create_engine

In [10]:
engine = create_engine('sqlite:///customer_transactions.db', echo=True)
df_customer_transaction.to_sql('employee', con=engine, if_exists='replace', index=False)
result = engine.execute('SELECT * FROM employee')
for row in result:
    print(row)

2023-11-21 17:31:02,641 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-11-21 17:31:02,650 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("employee")
2023-11-21 17:31:02,651 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-11-21 17:31:02,652 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("employee")
2023-11-21 17:31:02,653 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-11-21 17:31:02,653 INFO sqlalchemy.engine.Engine
CREATE TABLE employee (
	txn_id TEXT,
	avail_date TEXT,
	last_name TEXT,
	first_name TEXT,
	birthday TEXT
)


2023-11-21 17:31:02,654 INFO sqlalchemy.engine.Engine [no key 0.00064s] ()
2023-11-21 17:31:03,070 INFO sqlalchemy.engine.Engine INSERT INTO employee (txn_id, avail_date, last_name, first_name, birthday) VALUES (?, ?, ?, ?, ?)
2023-11-21 17:31:03,071 INFO sqlalchemy.engine.Engine [generated in 0.33459s] [('TXN-24546', '2030-09-08', 'ORTIZ', 'EDUARDO', '1990-07-08'), ('TXN-14642', '2026-05-26', 'NIENOW', 'LEA', '2000-11-26'), ('TXN-60295', '2006-09-25', 'LESCH', 'FLETA', '1993-05-22'), ('TXN-60295', '2006-09-25', 'LESCH', 'FLETA', '1993-05-22'), ('TXN-60295', '2006-09-25', 'LESCH', 'FLETA', '1993-05-22'), ('TXN-60295', '2006-09-25', 'LESCH', 'FLETA', '1993-05-22'), ('TXN-40462', '2021-08-21', 'KUHN', 'TOD', '2002-11-25'), ('TXN-40462', '2021-08-21', 'KUHN', 'TOD', '2002-11-25')  ... displaying 10 of 130653 total bound parameter sets ...  ('TXN-01784', '2015-01-11', 'Schmidt', 'Emilie', '1996-05-21'), ('TXN-01784', '2015-01-11', 'Schmidt', 'Emilie', '1996-05-21')]
2023-11-21 17:31:03,231 INFO sqlalchemy.engine.Engine COMMIT

AttributeError: 'Engine' object has no attribute 'execute'

# Cleaning the Database

In [11]:
## Checking for duplicates

In [12]:
##### Detects the duplicated data

In [41]:
print(df_customer_transaction[df_customer_transaction['txn_id'].duplicated(keep=False)])

           txn_id  avail_date last_name first_name    birthday
0       TXN-24546  2030-09-08     ORTIZ    EDUARDO  1990-07-08
1       TXN-14642  2026-05-26    NIENOW        LEA  2000-11-26
2       TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
3       TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
4       TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
...           ...         ...       ...        ...         ...
130648  TXN-65468  2012-06-16  Cummings      Henry  2005-08-14
130649  TXN-60822  2020-09-28      Feil     Jermey  2010-06-15
130650  TXN-60822  2020-09-28      Feil     Jermey  2010-06-15
130651  TXN-01784  2015-01-11   Schmidt     Emilie  1996-05-21
130652  TXN-01784  2015-01-11   Schmidt     Emilie  1996-05-21

[103233 rows x 5 columns]

In [ ]:
##### Stores the detected data on a variable

In [16]:
df_Duplicated_Customers = df_customer_transaction[df_customer_transaction.duplicated(keep=False)]

In [ ]:
print(df_Duplicated_Customers)

In [22]:
df_DropDuplicated_Customers = df_customer_transaction.drop_duplicates()

In [23]:
print(df_DropDuplicated_Customers)

           txn_id  avail_date last_name first_name    birthday
0       TXN-24546  2030-09-08     ORTIZ    EDUARDO  1990-07-08
1       TXN-14642  2026-05-26    NIENOW        LEA  2000-11-26
2       TXN-60295  2006-09-25     LESCH      FLETA  1993-05-22
6       TXN-40462  2021-08-21      KUHN        TOD  2002-11-25
8       TXN-08102  2010-04-03   JOHNSON     MILTON  2003-07-10
...           ...         ...       ...        ...         ...
130643  TXN-11897  2027-06-19   Reinger     Conrad  1996-12-03
130646  TXN-43876  2021-11-13    Jewess      Lucio  1996-07-05
130647  TXN-65468  2012-06-16  Cummings      Henry  2005-08-14
130649  TXN-60822  2020-09-28      Feil     Jermey  2010-06-15
130651  TXN-01784  2015-01-11   Schmidt     Emilie  1996-05-21

[72355 rows x 5 columns]

In [52]:
print(df_DropDuplicated_Customers[df_DropDuplicated_Customers['first_name'].duplicated()])

           txn_id  avail_date last_name first_name    birthday
135     TXN-41845  2026-01-13   HACKETT    ANNAMAE  2001-12-11
271     TXN-51508  2017-03-13     FRAMI       ZOIE  2003-02-26
347     TXN-54642  2025-01-07   SCHMITT     CURTIS  1994-11-18
428     TXN-12820  2027-11-29      LIND     HETTIE  1993-10-24
478     TXN-43559  2012-12-30   REICHEL      ADOLF  2007-06-29
...           ...         ...       ...        ...         ...
130643  TXN-11897  2027-06-19   Reinger     Conrad  1996-12-03
130646  TXN-43876  2021-11-13    Jewess      Lucio  1996-07-05
130647  TXN-65468  2012-06-16  Cummings      Henry  2005-08-14
130649  TXN-60822  2020-09-28      Feil     Jermey  2010-06-15
130651  TXN-01784  2015-01-11   Schmidt     Emilie  1996-05-21

[57615 rows x 5 columns]